DataProcessors/ПерепроведениеДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПерепроведениеДокументов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Руководители.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Руководители</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ВнутреннийЗаказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВнутреннийЗаказ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РегистрТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Статус</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заказы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ПерепроведениеДокументов/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Перепровести(Команда)    
	Ошибки = Новый  Массив();
	ПерепровестиНаСервере(Ошибки);
	Если Ошибки.Количество() = 0 Тогда 
		ПоказатьПредупреждение(Неопределено, "Документы проведены успешно",,"Успех");
	Иначе
		Сообщить("Есть ошибка");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПерепровестиНаСервере(Ошибки)
 	   	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Руководители.Подразделения КАК Подразделения
		|ПОМЕСТИТЬ ВТ_Подразделения
		|ИЗ
		|	РегистрСведений.Руководители КАК Руководители
		|ГДЕ
		|	Руководители.ДатаИзменения МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Подразделения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВнутреннийЗаказ.Ссылка КАК Документ
		|ИЗ
		|	Документ.ВнутреннийЗаказ КАК ВнутреннийЗаказ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Подразделения КАК ВТ_Подразделения
		|		ПО ВнутреннийЗаказ.Подразделения = ВТ_Подразделения.Подразделения
		|			И (ВнутреннийЗаказ.Проведен)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВнутреннийЗаказ.Дата";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДобавитьМесяц(ТекущаяДатаСеанса(),-1));
	Запрос.УстановитьПараметр("ДатаОкончания", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл    
		Попытка
				Перепроведение = ВыборкаДетальныеЗаписи.Документ.ПолучитьОбъект();
				Перепроведение.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
				ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); 
				ЗаписьЖурналаРегистрации("ВнутреннийДокумент.Перепроведение", 
				УровеньЖурналаРегистрации.Ошибка, ВыборкаДетальныеЗаписи.Документ.Метаданные(), ВыборкаДетальныеЗаписи.Документ);
				Сообщение = Новый  СообщениеПользователю();
				Сообщение.Текст = ТекстОшибки;
				Сообщение.Сообщить();
		КонецПопытки;
	КонецЦикла;
	
	
КонецПроцедуры
